cv.org
#+TITLE: Curriculum Vitae

[[[mailto:contact@arumoy.me][email]]][[[https://github.com/arumoy-shome][Github]]][[[https://www.linkedin.com/in/arumoyshome/][LinkedIn]]]

* Education
  
** [2018-2020] Msc. Computer Science, Big Data Engineering
   /Vrije Universiteit Amsterdam & Universiteit van Amsterdam,
   Amsterdam, The Netherlands/

** [2012-2018] Bsc. Honours System Design Engineering, Entrepreneurship Option
   /University of Waterloo, Waterloo, Canada/

* Publications

** [2019] ACE: Art, Color and Emotions
   /ACM International Conference/

   + Created a data driven platform for exploring visual sentiment and
     emotion in artistic paintings over time.
   + Trained a custom visual artistic sentiment extraction model using
     the OmniArt dataset.
   + The platform is web based and built using D3.js and Javascript.
   + The paper can be accessed via the [[https://dl.acm.org/doi/10.1145/3343031.3350588][ACM Digital Library]] and a short
     demo of the application can be found on [[https://youtu.be/B1ZM6EQgEvU][Youtube]].

* Public Projects

** [2018] 3D Kadaster

   + Developed a 3D model of all buildings in The Netherlands using
     AHN2 point cloud dataset and BAG building polygons dataset.
   + Processed data using Apache Spark, ran algorithms on SurfSara's
     Hathi cluster and created visualisations using Three.js.
   + Detailed information on the research question, datasets and
     methodology can be found in the [[file:assets/pdf/kadaster-optimized.pdf][paper]] and the visualisation can
     be viewed on the [[https://arumoy.me/3d-kadaster/][project website]].
   + The project received recognition and was added to the course
     instructor's [[https://event.cwi.nl/lsde/2018/showcase\_c1.shtml][Hall of Fame]].

** [2018] Knowledge Acquisition from CommonCrawl

   + Applied a complete knowledge acquisition pipeline to WARC
     datasets using natural language processing, part of speech
     tagging, named entity recognition and entity linking.
   + The algorithms were run in parallel using Apache Spark on the
     [[https://www.cs.vu.nl/das4/][DAS4 cluster]].
   + Proposed a novel idea to improve entity retrieval using machine
     learning, details for which can be found in the [[file:assets/pdf/wdp.pdf][paper]].

** [2018] Elevate

   + Collaborated with the Waterloo Regional Down Syndrome Society,
     Canada and Fundacion Paraiso Down, El Salvador.
   + Developed an improved and cheaper alternative to the
     state-of-the-art cognitive assessment tool for individuals with
     Down Syndrome using a Systems approach.
   + Developed a business plan and presented the product at several
     startup incubators and pitch competitions to procure funding.
   + An overview of user research, design methodology and engineering
     solution can be found on the [[https://arumoy.me/elevate/][project website]] with additional
     details in the [[file:assets/pdf/elevate.pdf][paper]].

* Work Experience

** [Mar--Sep 2020] Research Intern
   /Netherlands eScience Center, Amsterdam, The Netherlands/

   + Conducted interdisciplinary research in the field of Computer
     Science, Artificial Intelligence and Particle Physics.
   + Worked in collaboration with researchers from 3 institutes namely
     Universiteit van Amsterdam, Netherlands eScience Center and Nikhef.
   + Conducted signal processing using multi layer perceptrons to
     identify highly elusive neutrino particles.
   + Implemented a novel data processing pipeline for the [[https://km3net.org][KM3NeT
     Neutrino Telescope]] using state-of-the-art graph convolutional networks.
   + The pipeline was implemented using Python and deep learning
     models were developed using PyTorch.
   + Details on the research question, dataset and methodology can be
     found in the [[file:assets/pdf/thesis-optimized.pdf][paper]]. The project is open sourced and available on
     [[https://github.com/arumoy-shome/km3net][Github.]]

** [Apr--Jun 2020] Graduate Teaching Assistant
   /Vrije Universiteit Amsterdam, Amsterdam, The Netherlands/

   + Part-time teaching assistant to the [[https://studiegids.vu.nl/en/Master/2019-2020/computer-science/X\_400108][Data Mining Techniques]]
     graduate course at Vrije Universiteit Amsterdam presented by [[https://www.cs.vu.nl/\~mhoogen/][Dr.
     Mark Hoogendorn]].
   + Managed 17 student teams and helped them with practical
     assignments presented in Python.
   + Conducted weekly online tutorial sessions with students and
     clarified doubts regarding course logistics, concepts and theory.
   + Graded 70+ student assignments and provided constructive
     feedback. Managed students performed well in the course with an
     average grade of 8.7.
   + Received highly positive remarks from student evaluation.

** [2015--2016] Web Developer Intern
   /Shopify, Ottawa, Canada/

   + Worked as part of a dynamic team of developer, designers and
     product managers to implement numerous features such as web
     components, animations and styling on a mature Ruby on Rails
     project using Ruby, Javascript, HTML & SCSS.
   + Practised object oriented design principles and test driven
     development to refactor code and improve test coverage.
   + Used object relational mapping to lazy load data, reduce database
     calls and minimise server response time thus improving the
     application load time.

** [2014--2015] Intern & Freelance
   /Various Employees & Clients, Various Locations, Canada/

   + Worked at several large and small scale companies as part of
     University of Waterloo's Co-op program.
   + Worked as a freelance Ruby on Rails developer and created web
     applications as per client specifications.
   + Developed soft skills such as critical thinking, clear
     communication and conflict resolution which are vital in a
     professional environment.
   + Successfully completed technical projects such as designing,
     creating, testing and maintaining web applications.
   + Wrote shell scripts to automate testing frameworks.
   + More information can be found on [[https://linkedin.com/in/arumoyshome][LinkedIn]].

* Skills

** Technical

   + Proficient in *Python, Ruby, Javascript, Latex & Shell
     Scripting*.

** Communication

   + Native or bi-lingual proficiency in *English & Hindi*.
   + Elementary proficiency in *Dutch*.
