cv.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-02-02 Tue 14:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Curriculum Vitae</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Arumoy Shome" />
<link rel="stylesheet" href="assets/css/main.css" type="text/css"/>
<meta name="robots" content="noindex">
</head>
<body>
<div id="content">
<h1 class="title">Curriculum Vitae</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7cb91e1">Education</a>
<ul>
<li><a href="#org56f5f46">[2018-2020] Msc. Computer Science, Big Data Engineering</a></li>
<li><a href="#org0763907">[2012-2018] Bsc. Honours System Design Engineering, Entrepreneurship Option</a></li>
</ul>
</li>
<li><a href="#org8d71429">Publications</a>
<ul>
<li><a href="#org079b738">[2019] ACE: Art, Color and Emotions</a></li>
</ul>
</li>
<li><a href="#orgf51a26e">Public Projects</a>
<ul>
<li><a href="#org0bd30fe">[2018] 3D Kadaster</a></li>
<li><a href="#orga9486cc">[2018] Knowledge Acquisition from CommonCrawl</a></li>
<li><a href="#orgbcada42">[2018] Elevate</a></li>
</ul>
</li>
<li><a href="#orgba1bf35">Work Experience</a>
<ul>
<li><a href="#org7c60526">[Mar&#x2013;Sep 2020] Research Intern</a></li>
<li><a href="#orgdc45b6a">[Apr&#x2013;Jun 2020] Graduate Teaching Assistant</a></li>
<li><a href="#org4dd5327">[2015&#x2013;2016] Web Developer Intern</a></li>
<li><a href="#org652f4b2">[2014&#x2013;2015] Intern &amp; Freelance</a></li>
</ul>
</li>
<li><a href="#orga121c31">Skills</a>
<ul>
<li><a href="#org20fed8b">Technical</a></li>
<li><a href="#org73404bb">Communication</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
[<a href="mailto:contact@arumoy.me">email</a>][<a href="https://github.com/arumoy-shome">Github</a>][<a href="https://www.linkedin.com/in/arumoyshome/">LinkedIn</a>]
</p>

<div id="outline-container-org7cb91e1" class="outline-2">
<h2 id="org7cb91e1">Education</h2>
<div class="outline-text-2" id="text-org7cb91e1">
</div>
<div id="outline-container-org56f5f46" class="outline-3">
<h3 id="org56f5f46">[2018-2020] Msc. Computer Science, Big Data Engineering</h3>
<div class="outline-text-3" id="text-org56f5f46">
<p>
<i>Vrije Universiteit Amsterdam &amp; Universiteit van Amsterdam,
Amsterdam, The Netherlands</i>
</p>
</div>
</div>

<div id="outline-container-org0763907" class="outline-3">
<h3 id="org0763907">[2012-2018] Bsc. Honours System Design Engineering, Entrepreneurship Option</h3>
<div class="outline-text-3" id="text-org0763907">
<p>
<i>University of Waterloo, Waterloo, Canada</i>
</p>
</div>
</div>
</div>

<div id="outline-container-org8d71429" class="outline-2">
<h2 id="org8d71429">Publications</h2>
<div class="outline-text-2" id="text-org8d71429">
</div>
<div id="outline-container-org079b738" class="outline-3">
<h3 id="org079b738">[2019] ACE: Art, Color and Emotions</h3>
<div class="outline-text-3" id="text-org079b738">
<p>
<i>ACM International Conference</i>
</p>

<ul class="org-ul">
<li>Created a data driven platform for exploring visual sentiment and
emotion in artistic paintings over time.</li>
<li>Trained a custom visual artistic sentiment extraction model using
the OmniArt dataset.</li>
<li>The platform is web based and built using D3.js and Javascript.</li>
<li>The paper can be accessed via the <a href="https://dl.acm.org/doi/10.1145/3343031.3350588">ACM Digital Library</a> and a short
demo of the application can be found on <a href="https://youtu.be/B1ZM6EQgEvU">Youtube</a>.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf51a26e" class="outline-2">
<h2 id="orgf51a26e">Public Projects</h2>
<div class="outline-text-2" id="text-orgf51a26e">
</div>
<div id="outline-container-org0bd30fe" class="outline-3">
<h3 id="org0bd30fe">[2018] 3D Kadaster</h3>
<div class="outline-text-3" id="text-org0bd30fe">
<ul class="org-ul">
<li>Developed a 3D model of all buildings in The Netherlands using
AHN2 point cloud dataset and BAG building polygons dataset.</li>
<li>Processed data using Apache Spark, ran algorithms on SurfSara's
Hathi cluster and created visualisations using Three.js.</li>
<li>Detailed information on the research question, datasets and
methodology can be found in the <a href="assets/pdf/kadaster-optimized.pdf">paper</a> and the visualisation can
be viewed on the <a href="https://arumoy.me/3d-kadaster/">project website</a>.</li>
<li>The project received recognition and was added to the course
instructor's <a href="https://event.cwi.nl/lsde/2018/showcase%5C_c1.shtml">Hall of Fame</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-orga9486cc" class="outline-3">
<h3 id="orga9486cc">[2018] Knowledge Acquisition from CommonCrawl</h3>
<div class="outline-text-3" id="text-orga9486cc">
<ul class="org-ul">
<li>Applied a complete knowledge acquisition pipeline to WARC
datasets using natural language processing, part of speech
tagging, named entity recognition and entity linking.</li>
<li>The algorithms were run in parallel using Apache Spark on the
<a href="https://www.cs.vu.nl/das4/">DAS4 cluster</a>.</li>
<li>Proposed a novel idea to improve entity retrieval using machine
learning, details for which can be found in the <a href="assets/pdf/wdp.pdf">paper</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-orgbcada42" class="outline-3">
<h3 id="orgbcada42">[2018] Elevate</h3>
<div class="outline-text-3" id="text-orgbcada42">
<ul class="org-ul">
<li>Collaborated with the Waterloo Regional Down Syndrome Society,
Canada and Fundacion Paraiso Down, El Salvador.</li>
<li>Developed an improved and cheaper alternative to the
state-of-the-art cognitive assessment tool for individuals with
Down Syndrome using a Systems approach.</li>
<li>Developed a business plan and presented the product at several
startup incubators and pitch competitions to procure funding.</li>
<li>An overview of user research, design methodology and engineering
solution can be found on the <a href="https://arumoy.me/elevate/">project website</a> with additional
details in the <a href="assets/pdf/elevate.pdf">paper</a>.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgba1bf35" class="outline-2">
<h2 id="orgba1bf35">Work Experience</h2>
<div class="outline-text-2" id="text-orgba1bf35">
</div>
<div id="outline-container-org7c60526" class="outline-3">
<h3 id="org7c60526">[Mar&#x2013;Sep 2020] Research Intern</h3>
<div class="outline-text-3" id="text-org7c60526">
<p>
<i>Netherlands eScience Center, Amsterdam, The Netherlands</i>
</p>

<ul class="org-ul">
<li>Conducted interdisciplinary research in the field of Computer
Science, Artificial Intelligence and Particle Physics.</li>
<li>Worked in collaboration with researchers from 3 institutes namely
Universiteit van Amsterdam, Netherlands eScience Center and Nikhef.</li>
<li>Conducted signal processing using multi layer perceptrons to
identify highly elusive neutrino particles.</li>
<li>Implemented a novel data processing pipeline for the <a href="https://km3net.org">KM3NeT
Neutrino Telescope</a> using state-of-the-art graph convolutional networks.</li>
<li>The pipeline was implemented using Python and deep learning
models were developed using PyTorch.</li>
<li>Details on the research question, dataset and methodology can be
found in the <a href="assets/pdf/thesis-optimized.pdf">paper</a>. The project is open sourced and available on
<a href="https://github.com/arumoy-shome/km3net">Github.</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgdc45b6a" class="outline-3">
<h3 id="orgdc45b6a">[Apr&#x2013;Jun 2020] Graduate Teaching Assistant</h3>
<div class="outline-text-3" id="text-orgdc45b6a">
<p>
<i>Vrije Universiteit Amsterdam, Amsterdam, The Netherlands</i>
</p>

<ul class="org-ul">
<li>Part-time teaching assistant to the <a href="https://studiegids.vu.nl/en/Master/2019-2020/computer-science/X%5C_400108">Data Mining Techniques</a>
graduate course at Vrije Universiteit Amsterdam presented by <a href="https://www.cs.vu.nl/%5C~mhoogen/">Dr.
Mark Hoogendorn</a>.</li>
<li>Managed 17 student teams and helped them with practical
assignments presented in Python.</li>
<li>Conducted weekly online tutorial sessions with students and
clarified doubts regarding course logistics, concepts and theory.</li>
<li>Graded 70+ student assignments and provided constructive
feedback. Managed students performed well in the course with an
average grade of 8.7.</li>
<li>Received highly positive remarks from student evaluation.</li>
</ul>
</div>
</div>

<div id="outline-container-org4dd5327" class="outline-3">
<h3 id="org4dd5327">[2015&#x2013;2016] Web Developer Intern</h3>
<div class="outline-text-3" id="text-org4dd5327">
<p>
<i>Shopify, Ottawa, Canada</i>
</p>

<ul class="org-ul">
<li>Worked as part of a dynamic team of developer, designers and
product managers to implement numerous features such as web
components, animations and styling on a mature Ruby on Rails
project using Ruby, Javascript, HTML &amp; SCSS.</li>
<li>Practised object oriented design principles and test driven
development to refactor code and improve test coverage.</li>
<li>Used object relational mapping to lazy load data, reduce database
calls and minimise server response time thus improving the
application load time.</li>
</ul>
</div>
</div>

<div id="outline-container-org652f4b2" class="outline-3">
<h3 id="org652f4b2">[2014&#x2013;2015] Intern &amp; Freelance</h3>
<div class="outline-text-3" id="text-org652f4b2">
<p>
<i>Various Employees &amp; Clients, Various Locations, Canada</i>
</p>

<ul class="org-ul">
<li>Worked at several large and small scale companies as part of
University of Waterloo's Co-op program.</li>
<li>Worked as a freelance Ruby on Rails developer and created web
applications as per client specifications.</li>
<li>Developed soft skills such as critical thinking, clear
communication and conflict resolution which are vital in a
professional environment.</li>
<li>Successfully completed technical projects such as designing,
creating, testing and maintaining web applications.</li>
<li>Wrote shell scripts to automate testing frameworks.</li>
<li>More information can be found on <a href="https://linkedin.com/in/arumoyshome">LinkedIn</a>.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orga121c31" class="outline-2">
<h2 id="orga121c31">Skills</h2>
<div class="outline-text-2" id="text-orga121c31">
</div>
<div id="outline-container-org20fed8b" class="outline-3">
<h3 id="org20fed8b">Technical</h3>
<div class="outline-text-3" id="text-org20fed8b">
<ul class="org-ul">
<li>Proficient in <b>Python, Ruby, Javascript, Latex &amp; Shell
Scripting</b>.</li>
</ul>
</div>
</div>

<div id="outline-container-org73404bb" class="outline-3">
<h3 id="org73404bb">Communication</h3>
<div class="outline-text-3" id="text-org73404bb">
<ul class="org-ul">
<li>Native or bi-lingual proficiency in <b>English &amp; Hindi</b>.</li>
<li>Elementary proficiency in <b>Dutch</b>.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arumoy Shome</p>
<p class="date">Created: 2021-02-02 Tue 14:18</p>
</div>
</body>
</html>
